{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "conv2d_5/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group11-shard1of2", "group11-shard2of2"], "weights": [{"name": "conv2d_6/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "batch_normalization_6/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group13-shard1of5", "group13-shard2of5", "group13-shard3of5", "group13-shard4of5", "group13-shard5of5"], "weights": [{"name": "conv2d_7/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [1024], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_8/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv2d_11/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group19-shard1of2", "group19-shard2of2"], "weights": [{"name": "conv2d_9/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"name": "conv2d_12/kernel", "shape": [3, 3, 384, 256], "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"name": "batch_normalization_9/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [512], "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"name": "batch_normalization_11/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"name": "conv2d_10/kernel", "shape": [1, 1, 512, 255], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [255], "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"name": "conv2d_13/kernel", "shape": [1, 1, 256, 255], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [255], "dtype": "float32"}]}]}